Reports/гф_ФормированиеОбщейСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Report>
		<Properties>
			<Name>гф_ФормированиеОбщейСпецификации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВПарах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикОтбораНоменклатуры</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>гф_КонтрагентПолучатель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещенийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>гф_ТоварыВКоробах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDКороба</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПар</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>гф_ШтрихкодыУпаковок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнутреннееПотреблениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ВнутреннееПотреблениеТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеПоЗаказам</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннихПотреблений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаВнутреннееПотребление</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеДляДеятельности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_АдресДоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаАктивовПассивов</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияЭксплуатации</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаВнутреннееПотребление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЗапасов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/гф_ФормированиеОбщейСпецификации/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Отчет.Вид = "РеализацииПокупателей";
	УстановитьВидимостьРеквизитов(); 
	УстановитьВариантОтчета()
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтчета()
	
	Если Отчет.ФормироватьВПарах Тогда
		  УстановитьТекущийВариант("ВПарах");
	Иначе
		 УстановитьТекущийВариант("ВКоробах");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитов()
	
	Если Отчет.Вид = "РеализацииПокупателей" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость = Истина;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина; 
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Истина;				
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;
		
	ИначеЕсли Отчет.Вид = "ЗаказыКлиентов" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость = Истина;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		Элементы.ТаблицаДокументы.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Истина;		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;
	ИначеЕсли Отчет.Вид = "ПриобретениеТоваровИУслуг" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Истина; 
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		Элементы.ТаблицаДокументы.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Истина;		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;
		
	ИначеЕсли Отчет.Вид = "ВнутренниеЗаказы" Тогда
		
		Элементы.ФормироватьВПарах.Видимость = Ложь;
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость = Истина;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		Элементы.ТаблицаДокументы.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Ложь;		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;	
		
	ИначеЕсли Отчет.Вид = "СвободныеОстатки" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.СкладПолучатель.Заголовок = "Склад";
		Элементы.ДатаОстатков.Видимость = Истина;
		Элементы.ЦенаСоСкидкой.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.Видимость = Ложь; 
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
				
	ИначеЕсли Отчет.Вид = "ФактическиеОстатки" Тогда
		
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.СкладПолучатель.Заголовок = "Склад";
		Элементы.ДатаОстатков.Видимость = Истина;
		Элементы.ЦенаСоСкидкой.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		
	ИначеЕсли Отчет.Вид = "Ассортимент" Тогда	
		
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Истина;
		
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;		
		Элементы.ТаблицаДокументы.Видимость = Ложь;
				
	КонецЕсли; 	
	
КонецПроцедуры	

&НаКлиенте
Процедура Отметить(Команда)
	
	Для каждого Строка из Отчет.ТаблицаДокументы Цикл
			Строка.Пометка = Истина;		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда) 
	
	Для каждого Строка из Отчет.ТаблицаДокументы Цикл
			Строка.Пометка = Ложь;		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыНаСервере()
	
	Отчет.ТаблицаДокументы.Очистить();
	
	Если Отчет.Вид = "РеализацииПокупателей" Тогда
		 ЗаполнитьДокументы_РеализацииПокупателей();
	ИначеЕсли Отчет.Вид = "ЗаказыКлиентов" Тогда	
		 ЗаполнитьДокументы_ЗаказыКлиентов();
	ИначеЕсли Отчет.Вид = "ПриобретениеТоваровИУслуг" Тогда	
		 ЗаполнитьДокументы_ПриобретениеТоваровИУслуг();
	ИначеЕсли Отчет.Вид = "Перемещения" Тогда
		 ЗаполнитьДокументы_Перемещения();			
	ИначеЕсли Отчет.Вид = "ВнутренниеЗаказы" Тогда	
		 ЗаполнитьДокументы_ВнутренниеЗаказы();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы_РеализацииПокупателей()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА РеализацияТоваровУслуг.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА РеализацияТоваровУслуг.Договор = &ДоговорКонтрагента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("ОтборПоДоговору",ЗначениеЗаполнено(Отчет.ДоговорКонтрагента));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДокументы_ЗаказыКлиентов() 
		
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Документ,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаказКлиента.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ЗаказКлиента.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА ЗаказКлиента.Договор = &ДоговорКонтрагента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("ОтборПоДоговору",ЗначениеЗаполнено(Отчет.ДоговорКонтрагента));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДокументы_ПриобретениеТоваровИУслуг()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Документ,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПриобретениеТоваровУслуг.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ПриобретениеТоваровУслуг.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА ПриобретениеТоваровУслуг.Договор = &ДоговорКонтрагента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы_Перемещения()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Документ,
	|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПеремещениеТоваров.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоСкладуОтправителя
	|				ТОГДА ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоСкладуПолучателя
	|				ТОГДА ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоСкладуОтправителя", ЗначениеЗаполнено(Отчет.СкладОтправитель));
	Запрос.УстановитьПараметр("ОтборПоСкладуПолучателя", ЗначениеЗаполнено(Отчет.СкладПолучатель));
	Запрос.УстановитьПараметр("СкладОтправитель", Отчет.СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", Отчет.СкладПолучатель);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы_ВнутренниеЗаказы()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Документ,
	|	ВнутреннееПотреблениеТоваров.гф_Контрагент КАК Контрагент	
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВнутреннееПотреблениеТоваров.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ВнутреннееПотреблениеТоваров.гф_Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	ПолучитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтборы(Команда)  
	
	Если Элементы.СкрытьОтборы.Заголовок = "Скрыть отборы" Тогда 
		Элементы.ГруппаОтборы.Видимость = Ложь;
		Элементы.СкрытьОтборы.Заголовок = "Показать отборы";		
	Иначе
		Элементы.ГруппаОтборы.Видимость = Истина;
		Элементы.СкрытьОтборы.Заголовок = "Скрыть отборы"
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьВПарахПриИзменении(Элемент)
	УстановитьВариантОтчета();	
КонецПроцедуры
